app/controllers/personas_controller.rb

  def index
    if current_user.has_role? :admin
      redirect_to users_path
    else
      @personas = current_user.persona.order(id: :desc).page(params[:page])
---
SELECT  "personas".* FROM "personas" WHERE "personas"."user_id" = $1 AND "personas"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]

  def create
    @persona = current_user.persona.new(persona_params)
    if @persona.save
---
INSERT INTO "personas" ("cedula", "nombre", "apellido", "celular", "direccion", "user_id", "created_at", "updated_at", "correo") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    if @persona.update(persona_params)
---
UPDATE "personas" SET "direccion" = $1, "updated_at" = $2 WHERE "personas"."id" = $3  [["direccion", "Cra 6N # 101-26"], ["updated_at", "2019-07-13 06:24:01.527088"], ["id", 1]]

  def set_persona
    @persona = current_user.persona.find(params[:id])
---
SELECT  "personas".* FROM "personas" WHERE "personas"."user_id" = $1 AND "personas"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 15], ["LIMIT", 1]]