app/controllers/persona_controller.rb

  def index
    @personas = Persona.where(user_id: current_user.id)
---
SELECT "personas".* FROM "personas" WHERE "personas"."user_id" = $1  [["user_id", 1]]