app/controllers/users_controller.rb

SELECT  "personas".* FROM "personas" WHERE "personas"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 11]]
---
    def show
      @personas = @user.persona.order(id: :desc).page(params[:page])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def user_params
      @user = User.find(params[:id])